src/cfe/InformationRegisters/http_ЖурналВходящихЗапросов.xml
<?xml version="1.0" encoding="utf-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>http_ЖурналВходящихЗапросов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапроса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сервис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.http_HTTPМетоды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСостояния</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерЗапроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлючИдемпотентности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>&#13;
			<Resource>
				<Properties>
					<Name>ХешЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>&#13;
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/Enums/http_HTTPМетоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>http_HTTPМетоды</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>GET</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>POST</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PUT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PATCH</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DELETE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HEAD</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OPTIONS</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Catalogs/http_HTTPСервисы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>http_HTTPСервисы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журналирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьТелоЗапроса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьТелоОтвета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяДлинаТелаЗапроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейХраненияЗаписейЖурналов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбеспечениеИдемпотентности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяЗаголовкаИдемпотентности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольКонфликтовЗапросов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодГарантированнойРазблокировкиМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/CommonModules/http_HTTPКонвейер/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// http_HTTPКонвейер
//
// Главный конвейер обработки HTTP-запросов.
// Шаги в порядке выполнения (см. ОбработатьЗапрос()):
//   1.  Логирование начала
//   2.  Установка CORS-заголовков (до проверок - чтобы браузер видел при 4xx/5xx)
//   3.  Обработка CORS preflight (OPTIONS -> 204)
//   4.  Аутентификация
//   5.  Авторизация
//   6.  Определение формата входа (Content-Type)
//   7.  Определение формата выхода (Accept)
//   8.  Парсинг тела
//   9.  Валидация параметров пути
//   10. Валидация параметров query
//   11. Валидация тела
//   12. Объединение данных (путь + query + тело)
//   13. Вызов обработчика
//   14. Сериализация ответа
//   15. Установка прочих заголовков (статус, кэш)
//   16. Логирование завершения
//
// Точки расширения для прикладного кода - см. http_СерверПереопределяемый.
///////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Главная точка входа конвейера. Полностью выполняет обработку запроса:
// заполняет Ответ, логирует начало/завершение, вызывает обработчик маршрута.
//
// Параметры:
//  Запрос           - HTTPСервисЗапрос, HTTPЗапрос
//  Ответ            - HTTPСервисОтвет,  HTTPОтвет
//  ПараметрыМаршрута - Структура - см. http_СерверКлиентСервер.НовыйПараметрыМаршрута().
//
Процедура ОбработатьЗапрос(Запрос, Ответ, ПараметрыМаршрута) Экспорт

	Контекст = СоздатьКонтекст(Запрос, Ответ);

	// Параметры маршрута доступны обработчику через Контекст.Свойства
	Для Каждого Элемент Из ПараметрыМаршрута Цикл
		Контекст.Свойства.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;

	// Имя сервиса для журнала: явное переопределение из маршрута имеет приоритет
	Если ПараметрыМаршрута.Свойство("Сервис")
		И ТипЗнч(ПараметрыМаршрута.Сервис) = Тип("Строка")
		И Не ПустаяСтрока(ПараметрыМаршрута.Сервис) Тогда
		Контекст.Сервис = ПараметрыМаршрута.Сервис;
	КонецЕсли;

	// Применяем дефолты сервиса из Справочник.http_HTTPСервисы.
	// Маршрут может перекрыть их явным НастройкиЖурнала / Идемпотентность.
	ПрименитьНастройкиСервиса(Контекст, ПараметрыМаршрута);

	// Настройки журналирования из маршрута имеют наивысший приоритет
	Если ПараметрыМаршрута.Свойство("НастройкиЖурнала")
		И ТипЗнч(ПараметрыМаршрута.НастройкиЖурнала) = Тип("Структура") Тогда
		Для Каждого Элемент Из ПараметрыМаршрута.НастройкиЖурнала Цикл
			Контекст.НастройкиЖурнала.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;
	КонецЕсли;

	// Хук до обработки
	http_СерверПереопределяемый.ПередОбработкойЗапроса(Контекст);

	// 1. Лог начала
	ЛогироватьНачалоЗапроса(Контекст);

	// 2. CORS-заголовки
	УстановитьЗаголовкиCORS(Контекст, ПараметрыМаршрута);

	// 3. CORS preflight
	Если ОбработатьOptions(Контекст, ПараметрыМаршрута) Тогда
		ЛогироватьЗавершениеЗапроса(Контекст);
		Возврат;
	КонецЕсли;

	// 4. Аутентификация
	Если Не ВыполнитьАутентификацию(Контекст, ПараметрыМаршрута) Тогда
		ЗавершитьСОшибкой(Контекст);
		Возврат;
	КонецЕсли;

	// 5. Авторизация
	Если Не ПроверитьАвторизацию(Контекст, ПараметрыМаршрута) Тогда
		ЗавершитьСОшибкой(Контекст);
		Возврат;
	КонецЕсли;

	// 5a. Идемпотентность (если включена в маршруте). При обнаружении кэша
	// или конфликта ответ уже сформирован, конвейер выходит без дальнейших шагов.
	НастройкиИдемпотентности = ПолучитьИзСтруктуры(ПараметрыМаршрута, "Идемпотентность");
	Если Не http_ИдемпотентностьСлужебный.ПроверитьЗапрос(Контекст, НастройкиИдемпотентности) Тогда
		Если Контекст.Свойства.Получить("ИдемпотентныйКэш") = Истина Тогда
			// Кэш отдан - просто логируем завершение, ошибки нет
			ЛогироватьЗавершениеЗапроса(Контекст);
		Иначе
			ЗавершитьСОшибкой(Контекст);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	// 6. Формат входа
	Если Не ОпределитьФорматВхода(Контекст) Тогда
		ЗавершитьСОшибкой(Контекст);
		Возврат;
	КонецЕсли;

	// 7. Формат выхода
	ПредпочтительныйФормат = ?(ПараметрыМаршрута.Свойство("ФорматОтвета")
		И Не ПустаяСтрока(ПараметрыМаршрута.ФорматОтвета),
		ПараметрыМаршрута.ФорматОтвета, "JSON");

	Если Не ОпределитьФорматВыхода(Контекст, ПредпочтительныйФормат) Тогда
		ЗавершитьСОшибкой(Контекст);
		Возврат;
	КонецЕсли;

	// 8. Парсинг тела
	Если Не РазобратьТело(Контекст) Тогда
		ЗавершитьСОшибкой(Контекст);
		Возврат;
	КонецЕсли;

	// 9-11. Валидация
	Если Не ВалидироватьПараметрыПути(Контекст, ПараметрыМаршрута.СхемаПути) Тогда
		ЗавершитьСОшибкой(Контекст);
		Возврат;
	КонецЕсли;
	Если Не ВалидироватьПараметрыQuery(Контекст, ПараметрыМаршрута.СхемаQuery) Тогда
		ЗавершитьСОшибкой(Контекст);
		Возврат;
	КонецЕсли;
	Если Не ВалидироватьТело(Контекст, ПараметрыМаршрута.СхемаТела) Тогда
		ЗавершитьСОшибкой(Контекст);
		Возврат;
	КонецЕсли;

	// 12. Объединение данных
	ОбъединитьДанные(Контекст);

	// 13. Вызов обработчика
	Результат = ВызватьОбработчик(Контекст, ПараметрыМаршрута.Обработчик);
	Если ЕстьОшибка(Контекст) Тогда
		ЗавершитьСОшибкой(Контекст);
		Возврат;
	КонецЕсли;

	// 14. Сериализация
	Если Не СериализоватьОтвет(Контекст, Результат) Тогда
		ЗавершитьСОшибкой(Контекст);
		Возврат;
	КонецЕсли;

	// 15. Прочие заголовки (статус 200, кэш)
	УстановитьЗаголовкиОтвета(Контекст, ПараметрыМаршрута);

	// Хук после обработки
	http_СерверПереопределяемый.ПослеОбработкиЗапроса(Контекст);

	// 16. Лог завершения
	ЛогироватьЗавершениеЗапроса(Контекст);

КонецПроцедуры

// Создаёт контекст запроса. Доступен прикладному коду для нестандартных
// сценариев, когда полный конвейер не нужен.
//
// Параметры:
//  Запрос - HTTPСервисЗапрос, HTTPЗапрос
//  Ответ  - HTTPСервисОтвет,  HTTPОтвет
//
// Возвращаемое значение:
//  Структура - контекст запроса со всеми полями инициализированными в дефолты.
//
Функция СоздатьКонтекст(Запрос, Ответ) Экспорт

	Контекст = Новый Структура;

	// Транспортный слой
	Контекст.Вставить("HTTPЗапрос",            Запрос);
	Контекст.Вставить("HTTPОтвет",             Ответ);

	// Параметры запроса
	Контекст.Вставить("ПутьПараметры",         Новый Соответствие);
	Контекст.Вставить("QueryПараметры",        Новый Соответствие);
	Контекст.Вставить("ТелоДанные",            Неопределено);
	Контекст.Вставить("ОбъединенныеДанные",    Новый Структура);

	// Безопасность
	Контекст.Вставить("Аутентификация",        Новый Структура("Успешно", Ложь));

	// Состояние конвейера
	Контекст.Вставить("Ошибка",                Неопределено);
	Контекст.Вставить("Свойства",              Новый Соответствие);
	Контекст.Вставить("ВыбранныйФорматОтвета", "JSON");
	Контекст.Вставить("ВыбранныйПарсер",       Неопределено);
	Контекст.Вставить("ВыбранныйСериализатор", Неопределено);

	// Метрики
	Контекст.Вставить("ВремяНачала",           ТекущаяУниверсальнаяДатаВМиллисекундах());
	Контекст.Вставить("ДатаЗапроса",           ТекущаяДатаСеанса());

	// Идентификация - для журнала
	Контекст.Вставить("Идентификатор",         Строка(Новый УникальныйИдентификатор));
	Контекст.Вставить("Сервис",                http_АдаптерЗапросОтветСлужебный.ЗапросИмяСервиса(Запрос));

	// Настройки журналирования (могут быть переопределены маршрутом)
	НастройкиЖурнала = Новый Структура;
	НастройкиЖурнала.Вставить("Включено",              Истина);
	НастройкиЖурнала.Вставить("ЗаписыватьТелоЗапроса", Истина);
	НастройкиЖурнала.Вставить("ЗаписыватьТелоОтвета",  Истина);
	Контекст.Вставить("НастройкиЖурнала", НастройкиЖурнала);

	// Тело ответа сохраняется здесь при сериализации - для логирования
	Контекст.Вставить("ТелоОтвета", "");

	Возврат Контекст;

КонецФункции

// Устанавливает ошибку в контексте и заполняет HTTPОтвет.
// Повторный вызов перезаписывает предыдущую ошибку.
//
// Параметры:
//  Контекст    - Структура
//  Код         - Число   - HTTP-статус ошибки.
//  Сообщение   - Строка - краткое описание для клиента.
//  Подробности - Строка - детали для логирования (необязательно).
//
Процедура УстановитьОшибку(Контекст, Код, Сообщение, Подробности = "") Экспорт

	ОшибкаДетали = Новый Структура;
	ОшибкаДетали.Вставить("Код",         Код);
	ОшибкаДетали.Вставить("Сообщение",   Сообщение);
	ОшибкаДетали.Вставить("Подробности", Подробности);

	// Дать прикладному коду шанс изменить детали ошибки
	http_СерверПереопределяемый.ПриФормированииОшибки(Контекст, ОшибкаДетали);

	Контекст.Ошибка = ОшибкаДетали;

	Ответ = Контекст.HTTPОтвет;
	http_АдаптерЗапросОтветСлужебный.ОтветУстановитьКод(Ответ, ОшибкаДетали.Код);
	http_АдаптерЗапросОтветСлужебный.ОтветУстановитьТипСодержимого(Ответ, "application/json; charset=utf-8");

	ТелоОшибки = СформироватьТелоОшибки(ОшибкаДетали);
	http_АдаптерЗапросОтветСлужебный.ОтветУстановитьТело(Ответ, ТелоОшибки);
	Контекст.ТелоОтвета = ТелоОшибки;

КонецПроцедуры

// Проверяет, произошла ли ошибка в контексте.
//
// Параметры:
//  Контекст - Структура
//
// Возвращаемое значение:
//  Булево
//
Функция ЕстьОшибка(Контекст) Экспорт

	Возврат Контекст.Ошибка <> Неопределено;

КонецФункции

// Встроенный обработчик-эхо: возвращает строку из Контекст.Свойства["ТелоОтвета"]
// или фиксированную "Пинг-Понг" если не задано. Используется встроенным
// HTTP-сервисом http_Ping для smoke-теста всего конвейера.
//
// Параметры:
//  Контекст - Структура
//
// Возвращаемое значение:
//  Строка
//
Функция ВстроенныйОбработчикПинг(Контекст) Экспорт

	ТелоОтвета = Контекст.Свойства.Получить("ТелоОтвета");
	Если ПустаяСтрока(ТелоОтвета) Тогда
		ТелоОтвета = "Пинг-Понг";
	КонецЕсли;
	Возврат ТелоОтвета;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФормированиеОшибки

// Формирует тело JSON-ответа для ошибки.
//
// Параметры:
//  ОшибкаДетали - Структура - {Код, Сообщение, Подробности}.
//
// Возвращаемое значение:
//  Строка - JSON.
//
Функция СформироватьТелоОшибки(ОшибкаДетали)

	Данные = Новый Структура;
	Данные.Вставить("code",  ОшибкаДетали.Код);
	Данные.Вставить("error", ОшибкаДетали.Сообщение);

	Если Не ПустаяСтрока(ОшибкаДетали.Подробности) Тогда
		Данные.Вставить("details", ОшибкаДетали.Подробности);
	КонецЕсли;

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	Возврат ЗаписьJSON.Закрыть();

КонецФункции

#КонецОбласти

#Область Логирование

// Возвращает значение перечисления http_HTTPМетоды по имени, или Неопределено.
Функция МетодКакПеречисление(ИмяМетода)

	Попытка
		Возврат Перечисления.http_HTTPМетоды[ИмяМетода];
	Исключение
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

// Формирует curl-вид входящего запроса для записи в журнал.
Функция СформироватьCurlЗапроса(Запрос, ТелоЗапроса)

	Метод = http_АдаптерЗапросОтветСлужебный.ЗапросМетод(Запрос);
	Адрес = http_АдаптерЗапросОтветСлужебный.ЗапросАдрес(Запрос);

	Строки = Новый Массив;
	Строки.Добавить("curl -X " + Метод + " """ + Адрес + """");

	Для Каждого Заголовок Из Запрос.Заголовки Цикл
		Строки.Добавить("  -H """ + Заголовок.Ключ + ": " + Заголовок.Значение + """");
	КонецЦикла;

	Если Не ПустаяСтрока(ТелоЗапроса) Тогда
		Строки.Добавить("  --data '" + ТелоЗапроса + "'");
	КонецЕсли;

	Возврат СтрСоединить(Строки, " " + Символы.ПС);

КонецФункции

// Формирует curl-подобное представление исходящего ответа.
Функция СформироватьCurlОтвета(Ответ, ТелоОтвета)

	Статус = http_АдаптерЗапросОтветСлужебный.ОтветПолучитьКод(Ответ);
	Строки = Новый Массив;
	Строки.Добавить("HTTP/1.1 " + Статус);

	Для Каждого Заголовок Из Ответ.Заголовки Цикл
		Строки.Добавить(Заголовок.Ключ + ": " + Заголовок.Значение);
	КонецЦикла;

	Если Не ПустаяСтрока(ТелоОтвета) Тогда
		Строки.Добавить("");
		Строки.Добавить(ТелоОтвета);
	КонецЕсли;

	Возврат СтрСоединить(Строки, Символы.ПС);

КонецФункции

// Логирует начало обработки запроса в журнал регистрации + регистр сведений.
//
// Параметры:
//  Контекст - Структура - см. СоздатьКонтекст().
//
Процедура ЛогироватьНачалоЗапроса(Контекст)

	Запрос  = Контекст.HTTPЗапрос;
	Метод   = http_АдаптерЗапросОтветСлужебный.ЗапросМетод(Запрос);
	Адрес   = http_АдаптерЗапросОтветСлужебный.ЗапросАдрес(Запрос);

	Попытка
		ЗаписьЖурналаРегистрации(
			"HTTP-запрос: " + Метод + " " + Адрес,
			УровеньЖурналаРегистрации.Информация);
	Исключение
		// Логирование не должно прерывать обработку
		ОписаниеОшибкиИгнорируется = ОписаниеОшибки();
	КонецПопытки;

	Если Не Контекст.НастройкиЖурнала.Включено Тогда
		Возврат;
	КонецЕсли;

	Если ПустаяСтрока(Контекст.Сервис) Тогда
		// Сервис - обязательное измерение регистра, без него запись невозможна
		Возврат;
	КонецЕсли;

	Попытка
		УстановитьПривилегированныйРежим(Истина);

		ТелоЗапроса = ?(Контекст.НастройкиЖурнала.ЗаписыватьТелоЗапроса,
			http_АдаптерЗапросОтветСлужебный.ЗапросТелоКакСтрока(Запрос), "");

		МенеджерЗаписи = РегистрыСведений.http_ЖурналВходящихЗапросов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Идентификатор       = Контекст.Идентификатор;
		МенеджерЗаписи.ДатаЗапроса         = Контекст.ДатаЗапроса;
		МенеджерЗаписи.Сервис              = Контекст.Сервис;
		МенеджерЗаписи.Ресурс              = Адрес;
		МенеджерЗаписи.Метод               = МетодКакПеречисление(Метод);
		МенеджерЗаписи.ВремяНачала         = Контекст.ВремяНачала;
		МенеджерЗаписи.Запрос              = ТелоЗапроса;
		МенеджерЗаписи.РазмерЗапроса       = СтрДлина(ТелоЗапроса);
		МенеджерЗаписи.ТекстЗапроса        = СформироватьCurlЗапроса(Запрос, ТелоЗапроса);
		КлючИдемпотентности = Контекст.Свойства.Получить("КлючИдемпотентности");
		Если КлючИдемпотентности <> Неопределено Тогда
			МенеджерЗаписи.КлючИдемпотентности = КлючИдемпотентности;
		КонецЕсли;
		ХешЗапроса = Контекст.Свойства.Получить("ХешЗапроса");
		Если ХешЗапроса <> Неопределено Тогда
			МенеджерЗаписи.ХешЗапроса = ХешЗапроса;
		КонецЕсли;
		МенеджерЗаписи.Записать();

	Исключение
		Попытка
			ЗаписьЖурналаРегистрации(
				"http_HTTPКонвейер: ошибка записи начала запроса",
				УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
		Исключение
			// Игнорируем
			ОписаниеОшибкиИгнорируется = ОписаниеОшибки();
		КонецПопытки;
	КонецПопытки;

КонецПроцедуры

// Логирует завершение запроса. Обновляет существующую запись в регистре,
// найденную по Контекст.Идентификатор.
Процедура ЛогироватьЗавершениеЗапроса(Контекст)

	ВремяВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах() - Контекст.ВремяНачала;
	Статус          = http_АдаптерЗапросОтветСлужебный.ОтветПолучитьКод(Контекст.HTTPОтвет);

	Попытка
		ЗаписьЖурналаРегистрации(
			"Запрос завершен. Статус: " + Статус + ", время: " + Строка(ВремяВыполнения) + " мс",
			УровеньЖурналаРегистрации.Информация);
	Исключение
		// Игнорируем
		ОписаниеОшибкиИгнорируется = ОписаниеОшибки();
	КонецПопытки;

	Если Не Контекст.НастройкиЖурнала.Включено Тогда
		Возврат;
	КонецЕсли;

	Попытка
		УстановитьПривилегированныйРежим(Истина);

		ТелоОтвета = ?(Контекст.НастройкиЖурнала.ЗаписыватьТелоОтвета, Контекст.ТелоОтвета, "");

		НаборЗаписей = РегистрыСведений.http_ЖурналВходящихЗапросов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Идентификатор.Установить(Контекст.Идентификатор);
		НаборЗаписей.Прочитать();

		ТекстОтвета = СформироватьCurlОтвета(Контекст.HTTPОтвет, ТелоОтвета);

		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.КодСостояния = Статус;
			Запись.Длительность = ВремяВыполнения / 1000;
			Запись.Ответ        = ТелоОтвета;
			Запись.РазмерОтвета = СтрДлина(ТелоОтвета);
			Запись.ТекстОтвета  = ТекстОтвета;
		КонецЦикла;

		НаборЗаписей.Записать();

	Исключение
		Попытка
			ЗаписьЖурналаРегистрации(
				"http_HTTPКонвейер: ошибка записи завершения запроса",
				УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
		Исключение
			// Игнорируем
			ОписаниеОшибкиИгнорируется = ОписаниеОшибки();
		КонецПопытки;
	КонецПопытки;

КонецПроцедуры

// Финализатор при прерывании конвейера на любом шаге.
Процедура ЗавершитьСОшибкой(Контекст)

	Если ЕстьОшибка(Контекст) Тогда
		Ош = Контекст.Ошибка;
		Сообщение = "HTTP-ошибка: код " + Ош.Код + ", " + Ош.Сообщение;
		Попытка
			ЗаписьЖурналаРегистрации(Сообщение, УровеньЖурналаРегистрации.Ошибка, , , Ош.Подробности);
		Исключение
			// Игнорируем
			ОписаниеОшибкиИгнорируется = ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;

	ЛогироватьЗавершениеЗапроса(Контекст);

КонецПроцедуры

#КонецОбласти

#Область АутентификацияАвторизация

// Выполняет аутентификацию согласно настройкам маршрута.
// Делегирует кастомные типы в http_СерверПереопределяемый.ПриОпределенииАутентификации.
//
// Возвращаемое значение:
//  Булево - Истина если аутентификация успешна или не требуется.
//
Функция ВыполнитьАутентификацию(Контекст, ПараметрыМаршрута)

	Настройки = ПолучитьИзСтруктуры(ПараметрыМаршрута, "Аутентификация");

	Если Настройки = Неопределено
		Или ПолучитьИзСтруктуры(Настройки, "Тип") = "None" Тогда
		Контекст.Аутентификация.Успешно = Истина;
		Возврат Истина;
	КонецЕсли;

	ТипАутентификации = Настройки.Тип;
	Параметры         = ПолучитьИзСтруктуры(Настройки, "Параметры");

	// Сначала даём хук прикладному коду
	Обработано = Ложь;
	http_СерверПереопределяемый.ПриОпределенииАутентификации(Контекст, Настройки, Обработано);
	Если Обработано Тогда
		Возврат Не ЕстьОшибка(Контекст);
	КонецЕсли;

	// Штатные типы
	Если ТипАутентификации = "Basic" Тогда
		Возврат АутентификацияBasic(Контекст, Параметры);
	ИначеЕсли ТипАутентификации = "Bearer" Тогда
		Возврат АутентификацияBearer(Контекст, Параметры);
	ИначеЕсли ТипАутентификации = "APIKey" Тогда
		Возврат АутентификацияAPIKey(Контекст, Параметры);
	Иначе
		УстановитьОшибку(Контекст, 500, "Неизвестный тип аутентификации: " + ТипАутентификации);
		Возврат Ложь;
	КонецЕсли;

КонецФункции

// Basic-аутентификация - делегирует в http_АутентификацияСлужебный.
Функция АутентификацияBasic(Контекст, Параметры)

	Возврат http_АутентификацияСлужебный.АутентификацияBasic(Контекст, Параметры);

КонецФункции

// Bearer-аутентификация - делегирует в http_АутентификацияСлужебный
// (которая в свою очередь дёргает http_АутентификацияПереопределяемый).
Функция АутентификацияBearer(Контекст, Параметры)

	Возврат http_АутентификацияСлужебный.АутентификацияBearer(Контекст, Параметры);

КонецФункции

// APIKey-аутентификация - делегирует в http_АутентификацияСлужебный
// (сверка SHA-256 хеша с справочником http_APIКлючи).
Функция АутентификацияAPIKey(Контекст, Параметры)

	Возврат http_АутентификацияСлужебный.АутентификацияAPIKey(Контекст, Параметры);

КонецФункции

// Проверяет авторизацию по ролям аутентифицированного пользователя.
Функция ПроверитьАвторизацию(Контекст, ПараметрыМаршрута)

	Настройки = ПолучитьИзСтруктуры(ПараметрыМаршрута, "Авторизация");
	Если Настройки = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;

	ТипПравила = ПолучитьИзСтруктуры(Настройки, "Тип");
	Значение   = ПолучитьИзСтруктуры(Настройки, "Значение");

	Если ТипПравила = "Роли" Тогда

		РолиПользователя = ПолучитьИзСтруктуры(Контекст.Аутентификация, "Роли");
		Если ТипЗнч(РолиПользователя) <> Тип("Массив") Тогда
			УстановитьОшибку(Контекст, 500, "Роли пользователя не инициализированы");
			Возврат Ложь;
		КонецЕсли;

		Для Каждого Роль Из Значение Цикл
			Если РолиПользователя.Найти(Роль) <> Неопределено Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;

		УстановитьОшибку(Контекст, 403, "Недостаточно прав");
		Возврат Ложь;

	КонецЕсли;

	УстановитьОшибку(Контекст, 500, "Неизвестный тип авторизации: " + ТипПравила);
	Возврат Ложь;

КонецФункции

#КонецОбласти

#Область ПарсингФорматов

// Определяет формат тела запроса по Content-Type и выбирает парсер.
Функция ОпределитьФорматВхода(Контекст)

	Запрос = Контекст.HTTPЗапрос;

	Если Не http_АдаптерЗапросОтветСлужебный.ЗапросЕстьТело(Запрос) Тогда
		Контекст.ВыбранныйПарсер = Неопределено;
		Возврат Истина;
	КонецЕсли;

	ТипСодержимого = http_АдаптерЗапросОтветСлужебный.ЗапросЗаголовок(Запрос, "Content-Type");
	Если ПустаяСтрока(ТипСодержимого) Тогда
		УстановитьОшибку(Контекст, 400, "Отсутствует заголовок Content-Type");
		Возврат Ложь;
	КонецЕсли;

	ЧастиТипа = СтрРазделить(ТипСодержимого, ";");
	МимТип = НРег(СокрЛП(ЧастиТипа[0]));

	Если МимТип = "application/json" Тогда
		Контекст.ВыбранныйПарсер = "РазобратьJSON";
	ИначеЕсли МимТип = "application/xml" ИЛИ МимТип = "text/xml" Тогда
		Контекст.ВыбранныйПарсер = "РазобратьXML";
	ИначеЕсли МимТип = "application/x-www-form-urlencoded" Тогда
		Контекст.ВыбранныйПарсер = "РазобратьFormUrlEncoded";
	ИначеЕсли МимТип = "multipart/form-data" Тогда
		Контекст.ВыбранныйПарсер = "РазобратьMultipart";
	Иначе
		УстановитьОшибку(Контекст, 415, "Неподдерживаемый Content-Type: " + МимТип);
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции

// Определяет желаемый формат ответа по Accept.
Функция ОпределитьФорматВыхода(Контекст, Предпочтительный)

	Accept = http_АдаптерЗапросОтветСлужебный.ЗапросЗаголовок(Контекст.HTTPЗапрос, "Accept");

	Если ПустаяСтрока(Accept) ИЛИ Accept = "*/*" Тогда
		Формат = Предпочтительный;
	ИначеЕсли Найти(Accept, "application/json") > 0 Тогда
		Формат = "JSON";
	ИначеЕсли Найти(Accept, "application/xml") > 0 Тогда
		Формат = "XML";
	ИначеЕсли Найти(Accept, "text/plain") > 0 Тогда
		Формат = "PlainText";
	Иначе
		УстановитьОшибку(Контекст, 406, "Неподдерживаемый Accept: " + Accept);
		Возврат Ложь;
	КонецЕсли;

	Контекст.ВыбранныйФорматОтвета = Формат;
	Контекст.ВыбранныйСериализатор = "Сериализовать" + Формат;
	Возврат Истина;

КонецФункции

// Разбирает тело запроса согласно выбранному парсеру.
Функция РазобратьТело(Контекст)

	Парсер = Контекст.ВыбранныйПарсер;
	Если Парсер = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;

	Если Парсер = "РазобратьJSON" Тогда
		Возврат РазобратьJSON(Контекст);
	ИначеЕсли Парсер = "РазобратьXML" Тогда
		УстановитьОшибку(Контекст, 501, "Парсер XML не реализован");
		Возврат Ложь;
	ИначеЕсли Парсер = "РазобратьFormUrlEncoded" Тогда
		УстановитьОшибку(Контекст, 501, "Парсер form-urlencoded не реализован");
		Возврат Ложь;
	ИначеЕсли Парсер = "РазобратьMultipart" Тогда
		УстановитьОшибку(Контекст, 501, "Парсер multipart/form-data не реализован");
		Возврат Ложь;
	Иначе
		УстановитьОшибку(Контекст, 500, "Неизвестный парсер: " + Парсер);
		Возврат Ложь;
	КонецЕсли;

КонецФункции

Функция РазобратьJSON(Контекст)

	Попытка
		СтрокаТела = http_АдаптерЗапросОтветСлужебный.ЗапросТелоКакСтрока(Контекст.HTTPЗапрос);
		Если ПустаяСтрока(СтрокаТела) Тогда
			Контекст.ТелоДанные = Неопределено;
			Возврат Истина;
		КонецЕсли;

		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаТела);
		Контекст.ТелоДанные = ПрочитатьJSON(ЧтениеJSON, Истина);
		ЧтениеJSON.Закрыть();
		Возврат Истина;
	Исключение
		УстановитьОшибку(Контекст, 400, "Ошибка парсинга JSON", ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

КонецФункции

#КонецОбласти

#Область Валидация

Функция ВалидироватьПараметрыПути(Контекст, Схема)

	Контекст.ПутьПараметры = http_АдаптерЗапросОтветСлужебный.ЗапросПараметрыПути(Контекст.HTTPЗапрос);
	Если Схема = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат ВалидироватьПоСхеме(Контекст, Контекст.ПутьПараметры, Схема, "путь");

КонецФункции

Функция ВалидироватьПараметрыQuery(Контекст, Схема)

	Контекст.QueryПараметры = http_АдаптерЗапросОтветСлужебный.ЗапросПараметрыQuery(Контекст.HTTPЗапрос);
	Если Схема = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат ВалидироватьПоСхеме(Контекст, Контекст.QueryПараметры, Схема, "query");

КонецФункции

Функция ВалидироватьТело(Контекст, Схема)

	Если Схема = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;

	Если Контекст.ТелоДанные = Неопределено И Схема.Количество() > 0 Тогда
		УстановитьОшибку(Контекст, 400, "Отсутствует тело запроса");
		Возврат Ложь;
	КонецЕсли;

	Возврат ВалидироватьПоСхеме(Контекст, Контекст.ТелоДанные, Схема, "тело");

КонецФункции

Функция ВалидироватьПоСхеме(Контекст, Данные, Схема, Источник)

	Для Каждого ЭлементСхемы Из Схема Цикл
		ИмяПоля = ЭлементСхемы.Ключ;
		Правила = ЭлементСхемы.Значение;

		Если ТипЗнч(Правила) = Тип("Строка") Тогда
			ТипОжидаемый       = Правила;
			Обязательный       = Ложь;
			ДопустимыеЗначения = Неопределено;
			МинЗначение        = Неопределено;
			МаксЗначение       = Неопределено;
		Иначе
			ТипОжидаемый       = ПолучитьИзСтруктуры(Правила, "Тип");
			Обязательный       = ?(Правила.Свойство("Обязательный"),       Правила.Обязательный,       Ложь);
			ДопустимыеЗначения = ?(Правила.Свойство("ДопустимыеЗначения"), Правила.ДопустимыеЗначения, Неопределено);
			МинЗначение        = ?(Правила.Свойство("Мин"),                Правила.Мин,                Неопределено);
			МаксЗначение       = ?(Правила.Свойство("Макс"),               Правила.Макс,               Неопределено);
		КонецЕсли;

		ЗначениеПоля = Неопределено;
		Если ТипЗнч(Данные) = Тип("Соответствие") Тогда
			ЗначениеПоля = Данные.Получить(ИмяПоля);
		ИначеЕсли ТипЗнч(Данные) = Тип("Структура") Тогда
			Данные.Свойство(ИмяПоля, ЗначениеПоля);
		КонецЕсли;

		ЗначениеОтсутствует = ЗначениеПоля = Неопределено
			ИЛИ (ТипЗнч(ЗначениеПоля) = Тип("Строка") И ПустаяСтрока(ЗначениеПоля));

		Если Обязательный И ЗначениеОтсутствует Тогда
			УстановитьОшибку(Контекст, 400,
				"Отсутствует обязательный параметр '" + ИмяПоля + "' в " + Источник);
			Возврат Ложь;
		КонецЕсли;

		Если ЗначениеОтсутствует Тогда
			Продолжить;
		КонецЕсли;

		Если Не ПроверитьТип(ЗначениеПоля, ТипОжидаемый) Тогда
			УстановитьОшибку(Контекст, 400,
				"Параметр '" + ИмяПоля + "' должен быть типа " + ТипОжидаемый + " в " + Источник);
			Возврат Ложь;
		КонецЕсли;

		Если ДопустимыеЗначения <> Неопределено
			И ТипЗнч(ДопустимыеЗначения) = Тип("Массив")
			И ДопустимыеЗначения.Найти(ЗначениеПоля) = Неопределено Тогда
			УстановитьОшибку(Контекст, 400,
				"Параметр '" + ИмяПоля + "' имеет недопустимое значение в " + Источник);
			Возврат Ложь;
		КонецЕсли;

		Если МинЗначение <> Неопределено И ЗначениеПоля < МинЗначение Тогда
			УстановитьОшибку(Контекст, 400,
				"Параметр '" + ИмяПоля + "' меньше минимально допустимого значения (" + МинЗначение + ")");
			Возврат Ложь;
		КонецЕсли;

		Если МаксЗначение <> Неопределено И ЗначениеПоля > МаксЗначение Тогда
			УстановитьОшибку(Контекст, 400,
				"Параметр '" + ИмяПоля + "' превышает максимально допустимое значение (" + МаксЗначение + ")");
			Возврат Ложь;
		КонецЕсли;

	КонецЦикла;

	Возврат Истина;

КонецФункции

Функция ПроверитьТип(Значение, ИмяТипа)

	СоответствиеТипов = Новый Соответствие;
	СоответствиеТипов.Вставить("Строка",    Тип("Строка"));
	СоответствиеТипов.Вставить("Число",     Тип("Число"));
	СоответствиеТипов.Вставить("Булево",    Тип("Булево"));
	СоответствиеТипов.Вставить("Дата",      Тип("Дата"));
	СоответствиеТипов.Вставить("Массив",    Тип("Массив"));
	СоответствиеТипов.Вставить("Структура", Тип("Структура"));

	ОжидаемыйТип = СоответствиеТипов.Получить(ИмяТипа);
	Если ОжидаемыйТип = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат ТипЗнч(Значение) = ОжидаемыйТип;

КонецФункции

#КонецОбласти

#Область ОбъединениеИВызов

// Формирует Контекст.ОбъединенныеДанные = путь + query + тело
// (последнее имеет наивысший приоритет).
Процедура ОбъединитьДанные(Контекст)

	Объединенные = Новый Структура;

	ДобавитьВСтруктуруИзСоответствия(Объединенные, Контекст.ПутьПараметры);
	ДобавитьВСтруктуруИзСоответствия(Объединенные, Контекст.QueryПараметры);

	Тело = Контекст.ТелоДанные;
	Если Тело <> Неопределено Тогда
		Если ТипЗнч(Тело) = Тип("Структура") Тогда
			Для Каждого КлючЗначение Из Тело Цикл
				Объединенные.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
			КонецЦикла;
		ИначеЕсли ТипЗнч(Тело) = Тип("Соответствие") Тогда
			ДобавитьВСтруктуруИзСоответствия(Объединенные, Тело);
		Иначе
			Объединенные.Вставить("_body", Тело);
		КонецЕсли;
	КонецЕсли;

	Контекст.ОбъединенныеДанные = Объединенные;

КонецПроцедуры

Процедура ДобавитьВСтруктуруИзСоответствия(Структура, Соответствие)

	Если Соответствие = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Для Каждого Элемент Из Соответствие Цикл
		Структура.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;

КонецПроцедуры

// Безопасный вызов обработчика маршрута.
// Имя обработчика задаётся в коде маршрута (а не в теле запроса), поэтому
// использование Выполнить() допустимо. В Фазе 3 (JRPC) переходим на
// ОбщегоНазначения.ОбщийМодуль() без Выполнить().
Функция ВызватьОбработчик(Контекст, ИмяОбработчика)

	Если ПустаяСтрока(ИмяОбработчика) Тогда
		УстановитьОшибку(Контекст, 500, "Не задан обработчик маршрута");
		Возврат Неопределено;
	КонецЕсли;

	Результат = Неопределено;

	Попытка
		Выполнить("Результат = " + ИмяОбработчика + "(Контекст)");
	Исключение
		УстановитьОшибку(Контекст, 500,
			"Ошибка выполнения обработчика: " + ИмяОбработчика,
			ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область Сериализация

Функция СериализоватьОтвет(Контекст, Результат)

	Сериализатор = Контекст.ВыбранныйСериализатор;

	Если Сериализатор = "СериализоватьJSON" Тогда
		Возврат СериализоватьJSON(Контекст, Результат);
	ИначеЕсли Сериализатор = "СериализоватьXML" Тогда
		УстановитьОшибку(Контекст, 501, "Сериализация XML не реализована");
		Возврат Ложь;
	ИначеЕсли Сериализатор = "СериализоватьPlainText" Тогда
		Возврат СериализоватьPlainText(Контекст, Результат);
	Иначе
		УстановитьОшибку(Контекст, 500, "Неизвестный сериализатор: " + Сериализатор);
		Возврат Ложь;
	КонецЕсли;

КонецФункции

Функция СериализоватьJSON(Контекст, Результат)

	Попытка
		Если ТипЗнч(Результат) = Тип("Строка") Тогда
			СтрокаJSON = Результат;
		Иначе
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			ЗаписатьJSON(ЗаписьJSON, Результат);
			СтрокаJSON = ЗаписьJSON.Закрыть();
		КонецЕсли;

		http_АдаптерЗапросОтветСлужебный.ОтветУстановитьТипСодержимого(
			Контекст.HTTPОтвет, "application/json; charset=utf-8");
		http_АдаптерЗапросОтветСлужебный.ОтветУстановитьТело(Контекст.HTTPОтвет, СтрокаJSON);
		Контекст.ТелоОтвета = СтрокаJSON;
		Возврат Истина;
	Исключение
		УстановитьОшибку(Контекст, 500, "Ошибка сериализации JSON", ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

КонецФункции

Функция СериализоватьPlainText(Контекст, Результат)

	Текст = ?(ТипЗнч(Результат) = Тип("Строка"), Результат, Строка(Результат));
	http_АдаптерЗапросОтветСлужебный.ОтветУстановитьТипСодержимого(
		Контекст.HTTPОтвет, "text/plain; charset=utf-8");
	http_АдаптерЗапросОтветСлужебный.ОтветУстановитьТело(Контекст.HTTPОтвет, Текст);
	Контекст.ТелоОтвета = Текст;
	Возврат Истина;

КонецФункции

#КонецОбласти

#Область CORSиЗаголовки

Процедура УстановитьЗаголовкиCORS(Контекст, ПараметрыМаршрута)

	Ответ = Контекст.HTTPОтвет;

	Если Не ПараметрыМаршрута.Свойство("CORS") Тогда
		Возврат;
	КонецЕсли;

	НастройкиCORS = ПараметрыМаршрута.CORS;

	Если ТипЗнч(НастройкиCORS) = Тип("Булево") И НастройкиCORS Тогда
		http_АдаптерЗапросОтветСлужебный.ОтветУстановитьЗаголовок(Ответ, "Access-Control-Allow-Origin",  "*");
		http_АдаптерЗапросОтветСлужебный.ОтветУстановитьЗаголовок(Ответ, "Access-Control-Allow-Methods", "GET, POST, PUT, DELETE, PATCH, OPTIONS");
		http_АдаптерЗапросОтветСлужебный.ОтветУстановитьЗаголовок(Ответ, "Access-Control-Allow-Headers", "Content-Type, Authorization, X-API-Key");
	ИначеЕсли ТипЗнч(НастройкиCORS) = Тип("Структура") Тогда
		Если НастройкиCORS.Свойство("AllowedOrigins") Тогда
			http_АдаптерЗапросОтветСлужебный.ОтветУстановитьЗаголовок(Ответ, "Access-Control-Allow-Origin",  НастройкиCORS.AllowedOrigins);
		КонецЕсли;
		Если НастройкиCORS.Свойство("AllowedMethods") Тогда
			http_АдаптерЗапросОтветСлужебный.ОтветУстановитьЗаголовок(Ответ, "Access-Control-Allow-Methods", НастройкиCORS.AllowedMethods);
		КонецЕсли;
		Если НастройкиCORS.Свойство("AllowedHeaders") Тогда
			http_АдаптерЗапросОтветСлужебный.ОтветУстановитьЗаголовок(Ответ, "Access-Control-Allow-Headers", НастройкиCORS.AllowedHeaders);
		КонецЕсли;
		Если НастройкиCORS.Свойство("MaxAge") Тогда
			http_АдаптерЗапросОтветСлужебный.ОтветУстановитьЗаголовок(Ответ, "Access-Control-Max-Age", Строка(НастройкиCORS.MaxAge));
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьЗаголовкиОтвета(Контекст, ПараметрыМаршрута)

	Ответ = Контекст.HTTPОтвет;

	Если Не ЕстьОшибка(Контекст) Тогда
		http_АдаптерЗапросОтветСлужебный.ОтветУстановитьКод(Ответ, 200);
	КонецЕсли;

	Если ПараметрыМаршрута.Свойство("Кэширование") Тогда
		Кэш = ПараметрыМаршрута.Кэширование;
		Если ТипЗнч(Кэш) = Тип("Структура") И Кэш.Свойство("Control") Тогда
			http_АдаптерЗапросОтветСлужебный.ОтветУстановитьЗаголовок(Ответ, "Cache-Control", Кэш.Control);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Функция ОбработатьOptions(Контекст, ПараметрыМаршрута)

	Если http_АдаптерЗапросОтветСлужебный.ЗапросМетод(Контекст.HTTPЗапрос) <> "OPTIONS" Тогда
		Возврат Ложь;
	КонецЕсли;

	УстановитьЗаголовкиCORS(Контекст, ПараметрыМаршрута);
	http_АдаптерЗапросОтветСлужебный.ОтветУстановитьКод(Контекст.HTTPОтвет, 204);
	Возврат Истина;

КонецФункции

#КонецОбласти

#Область Утилиты

// Безопасное извлечение из Структуры - Неопределено если поля нет.
Функция ПолучитьИзСтруктуры(Структура, ИмяПоля)

	Если ТипЗнч(Структура) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Значение = Неопределено;
	Структура.Свойство(ИмяПоля, Значение);
	Возврат Значение;

КонецФункции

// Применяет настройки сервиса из Справочник.http_HTTPСервисы к контексту.
// Действует как "дефолты сервиса": устанавливает Контекст.НастройкиЖурнала
// и при необходимости Идемпотентность из справочника. Маршрут вызывается
// после и может перекрыть эти значения.
//
// Если для сервиса нет записи в справочнике - используются дефолты модуля
// менеджера (см. Справочники.http_HTTPСервисы.НастройкиПоУмолчанию).
//
// Если сервис отключён (Используется=Ложь) - устанавливается 503 Service
// Unavailable и контекст помечается ошибкой.
Процедура ПрименитьНастройкиСервиса(Контекст, ПараметрыМаршрута)

	Если ПустаяСтрока(Контекст.Сервис) Тогда
		Возврат;
	КонецЕсли;

	Настройки = http_СерверСлужебныйПовтИсп.НастройкиHTTPСервиса(Контекст.Сервис);

	// Сервис отключён администратором
	Если Не Настройки.Используется Тогда
		УстановитьОшибку(Контекст, 503,
			"Сервис '" + Контекст.Сервис + "' отключён",
			"Используется = Ложь в Справочник.http_HTTPСервисы");
		Возврат;
	КонецЕсли;

	// Журналирование (маршрут может перекрыть)
	Контекст.НастройкиЖурнала.Включено              = Настройки.Журналирование;
	Контекст.НастройкиЖурнала.ЗаписыватьТелоЗапроса = Настройки.РегистрироватьТелоЗапроса;
	Контекст.НастройкиЖурнала.ЗаписыватьТелоОтвета  = Настройки.РегистрироватьТелоОтвета;

	// Идемпотентность из настроек сервиса - если в маршруте явно не задана
	НастройкиИдемпотентностиМаршрута = ПолучитьИзСтруктуры(ПараметрыМаршрута, "Идемпотентность");
	Если НастройкиИдемпотентностиМаршрута = Неопределено
		И Настройки.ОбеспечениеИдемпотентности Тогда
		НастройкаИдемпотентности = Новый Структура;
		НастройкаИдемпотентности.Вставить("ИмяЗаголовка", Настройки.ИмяЗаголовкаИдемпотентности);
		ПараметрыМаршрута.Вставить("Идемпотентность", НастройкаИдемпотентности);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
